ДоставкаЗаказов/src/InformationRegisters/ЦеныПоставщиков/ЦеныПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПоставщиков</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДоставкаЗаказов/src/CommonModules/ЗакупкиВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Получить цену покупки номенклатуры.
// 
// Параметры:
//  Дата - Дата
//  Контрагент - СправочникСсылка
//  Номенклатура - СправочникСсылка
// 
// Возвращаемое значение:
//  Число
Функция ПолучитьЦенуПокупкиНоменклатуры(Дата, Контрагент, Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата", 			Дата);
	Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Цена
	|ИЗ
	|	РегистрСведений.ЦеныПоставщиков.СрезПоследних(&Дата, 
	|													Контрагент 		= &Контрагент 
	|												    И Номенклатура 	= &Номенклатура)
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ЕСТЬNULL(Номенклатура.ЦенаПокупки, 0) КАК Цена
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Номенклатура";
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Цена;
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Цена;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
